In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    'Population': [245,367,578,66],
    'Counties': ['Kisumu','Nairobi', 'Machakos', 'Nakuru'],
    'GDP': [52.1,37.55, 90.0, 32.1]}, columns = ['Population', 'Counties', 'GDP']
)
df

   Population  Counties    GDP
0         245    Kisumu  52.10
1         367   Nairobi  37.55
2         578  Machakos  90.00
3          66    Nakuru  32.10

In [4]:
df.index = ['Kenya','Uganda','Tanzania','Rwanda']
df

          Population  Counties    GDP
Kenya            245    Kisumu  52.10
Uganda           367   Nairobi  37.55
Tanzania         578  Machakos  90.00
Rwanda            66    Nakuru  32.10

In [5]:
df.columns

Index(['Population', 'Counties', 'GDP'], dtype='object')

In [6]:
df.index

Index(['Kenya', 'Uganda', 'Tanzania', 'Rwanda'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Kenya to Rwanda
Data columns (total 3 columns):
Population    4 non-null int64
Counties      4 non-null object
GDP           4 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [8]:
df.shape

(4, 3)

In [9]:
df.size

12

In [14]:
df.describe()

       Population        GDP
count    4.000000   4.000000
mean   314.000000  52.937500
std    215.073631  26.110706
min     66.000000  32.100000
25%    200.250000  36.187500
50%    306.000000  44.825000
75%    419.750000  61.575000
max    578.000000  90.000000

In [12]:
df.dtypes

Population      int64
Counties       object
GDP           float64
dtype: object

In [13]:
df.dtypes.value_counts()

int64      1
object     1
float64    1
dtype: int64

### Indexing, selection and slicing

In [15]:
df['GDP']

Kenya       52.10
Uganda      37.55
Tanzania    90.00
Rwanda      32.10
Name: GDP, dtype: float64

In [16]:
df[1:]

          Population  Counties    GDP
Uganda           367   Nairobi  37.55
Tanzania         578  Machakos  90.00
Rwanda            66    Nakuru  32.10

In [21]:
df[2:]

          Population  Counties   GDP
Tanzania         578  Machakos  90.0
Rwanda            66    Nakuru  32.1